In [127]:
import numpy as np
import pandas as pd

In [128]:
a = np.array([1,2,3,4])
print(a)
ds = pd.Series([1,2,3,4])
print(ds)

[1 2 3 4]
0    1
1    2
2    3
3    4
dtype: int64

In [129]:
prices_ds = pd.Series([1.5, 2, 2.5, 3],
            index=["apples", "oranges", "bananas", "strawberries"])
prices_ds

apples          1.5
oranges         2.0
bananas         2.5
strawberries    3.0
dtype: float64

In [130]:
s1 = pd.Series({
    'apples': 1.5,
    'oranges':2,
    'bananas':2.5
})
s1

apples     1.5
oranges    2.0
bananas    2.5
dtype: float64

In [131]:
print( s1['oranges'])

2.0

### Series slicing

In [132]:
s = pd.Series(np.arange(1,11))
s

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [133]:
s[  [1,3,8]   ]

1    2
3    4
8    9
dtype: int64

In [134]:
s[ 1::2 ]

1     2
3     4
5     6
7     8
9    10
dtype: int64

In [135]:
# TODO: 'in' in data, not keys
4 in s

True

### DataFrame

In [136]:
# from series

# by dictionary
s1 = pd.Series({
    'a':1,
    'c':3
})

# by list:
s1 = pd.Series( [1,3], index=['a','c'] )

s1

a    1
c    3
dtype: int64

In [137]:
df = pd.DataFrame( s1, columns=['A'] )
df

   A
a  1
c  3

In [138]:
lyuba_df = pd.read_excel('../data/29.1.xlsx')

In [139]:
titanic_df = pd.read_csv('../../datasets/train_and_test2.csv')

In [140]:
titanic_df.head(2)

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.0,7.2500,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1,2,38.0,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1

In [141]:
titanic_df.columns

Index(['Passengerid', 'Age', 'Fare', 'Sex', 'sibsp', 'zero', 'zero.1',
       'zero.2', 'zero.3', 'zero.4', 'zero.5', 'zero.6', 'Parch', 'zero.7',
       'zero.8', 'zero.9', 'zero.10', 'zero.11', 'zero.12', 'zero.13',
       'zero.14', 'Pclass', 'zero.15', 'zero.16', 'Embarked', 'zero.17',
       'zero.18', '2urvived'],
      dtype='object')

In [142]:
len(titanic_df.columns)

28

In [143]:
titanic_df

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
0,1,22.0,7.2500,0,1,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1,2,38.0,71.2833,1,1,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,1
2,3,26.0,7.9250,1,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,1
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
4,5,35.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,1305,28.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1305,1306,39.0,108.9000,1,0,0,0,0,0,0,...,0,0,0,1,0,0,0.0,0,0,0
1306,1307,38.5,7.2500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1307,1308,28.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
1308,1309,28.0,22.3583,0,1,0,0,0,0,0,...,0,0,0,3,0,0,0.0,0,0,0

In [144]:
titanic_df['2urvived'].head(10)

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: 2urvived, dtype: int64

In [145]:
# get list of COLUMNS
titanic_df[['Sex','2urvived']]

      Sex  2urvived
0       0         0
1       1         1
2       1         1
3       1         1
4       0         0
...   ...       ...
1304    0         0
1305    1         0
1306    0         0
1307    0         0
1308    0         0

[1309 rows x 2 columns]

In [146]:
# get list of rows
titanic_df.iloc[[3,5]]

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
5,6,28.0,8.4583,0,0,0,0,0,0,0,...,0,0,0,3,0,0,1.0,0,0,0

In [147]:
# index slicing
titanic_df.iloc[ 3:8 ]

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
3,4,35.0,53.1000,1,1,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,1
4,5,35.0,8.0500,0,0,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0
5,6,28.0,8.4583,0,0,0,0,0,0,0,...,0,0,0,3,0,0,1.0,0,0,0
6,7,54.0,51.8625,0,0,0,0,0,0,0,...,0,0,0,1,0,0,2.0,0,0,0
7,8,2.0,21.0750,0,3,0,0,0,0,0,...,0,0,0,3,0,0,2.0,0,0,0

In [148]:
titanic_df.loc[7, 'sibsp']

3

In [149]:
titanic_df.loc[:,'Passengerid':'zero']

      Passengerid   Age      Fare  Sex  sibsp  zero
0               1  22.0    7.2500    0      1     0
1               2  38.0   71.2833    1      1     0
2               3  26.0    7.9250    1      0     0
3               4  35.0   53.1000    1      1     0
4               5  35.0    8.0500    0      0     0
...           ...   ...       ...  ...    ...   ...
1304         1305  28.0    8.0500    0      0     0
1305         1306  39.0  108.9000    1      0     0
1306         1307  38.5    7.2500    0      0     0
1307         1308  28.0    8.0500    0      0     0
1308         1309  28.0   22.3583    0      1     0

[1309 rows x 6 columns]

In [150]:
titanic_df.loc[5:10, 'Passengerid':'zero']

    Passengerid   Age     Fare  Sex  sibsp  zero
5             6  28.0   8.4583    0      0     0
6             7  54.0  51.8625    0      0     0
7             8   2.0  21.0750    0      3     0
8             9  27.0  11.1333    1      0     0
9            10  14.0  30.0708    1      1     0
10           11   4.0  16.7000    1      1     0

In [151]:
# # TODO: numpay array simple indexing
# l = [1,2,3,4,5,6,7]
# l[ 3:6 ]


# l[ [3,6] ]

In [152]:
titanic_df.shape

(1309, 28)

In [153]:
titanic_df.describe()

,Passengerid,Age,Fare,Sex,sibsp,zero,zero.1,zero.2,zero.3,zero.4,...,zero.12,zero.13,zero.14,Pclass,zero.15,zero.16,Embarked,zero.17,zero.18,2urvived
count,1309.000000,1309.000000,1309.000000,1309.000000,1309.000000,1309.0,1309.0,1309.0,1309.0,1309.0,...,1309.0,1309.0,1309.0,1309.000000,1309.0,1309.0,1307.000000,1309.0,1309.0,1309.000000
mean,655.000000,29.503186,33.281086,0.355997,0.498854,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,2.294882,0.0,0.0,1.492731,0.0,0.0,0.261268
std,378.020061,12.905241,51.741500,0.478997,1.041658,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.837836,0.0,0.0,0.814626,0.0,0.0,0.439494
min,1.000000,0.170000,0.000000,0.000000,0.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,1.000000,0.0,0.0,0.000000,0.0,0.0,0.000000
25%,328.000000,22.000000,7.895800,0.000000,0.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,2.000000,0.0,0.0,1.000000,0.0,0.0,0.000000
50%,655.000000,28.000000,14.454200,0.000000,0.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,3.000000,0.0,0.0,2.000000,0.0,0.0,0.000000
75%,982.000000,35.000000,31.275000,1.000000,1.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,3.000000,0.0,0.0,2.000000,0.0,0.0,1.000000
max,1309.000000,80.000000,512.329200,1.000000,8.000000,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,3.000000,0.0,0.0,2.000000,0.0,0.0,1.000000

In [154]:
numbers_df = pd.read_csv('../../datasets/numbers_demo_2.csv', 
             header=None, 
             delimiter=';')

In [155]:
numbers_df

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [156]:
# get slice of [11,12], [15,16]
numbers_df.loc[ 2:3, 2:3 ]

    2   3
2  11  12
3  15  16

In [157]:
numbers_df.loc[ [0,3] , [0,3] ]

    0   3
0   1   4
3  13  16

In [158]:
numbers_df.loc[0:0, [0,3] ]

   0  3
0  1  4

In [159]:
numbers_df_2 = pd.read_csv('../../datasets/numbers_demo_2.csv', 
             header=None, 
             delimiter=';',
             names=['A', 'B', 'C', 'D'])
numbers_df_2

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [160]:
numbers_df_2.loc[ [0,3] , ['A','D'] ]

    A   D
0   1   4
3  13  16

In [161]:
numbers_df_3 = pd.read_csv('../../datasets/numbers_demo_2.csv', 
             header=None, 
             delimiter=';')

numbers_df_3

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [162]:
numbers_df_3.columns = ['A','B','C','D']
numbers_df_3

    A   B   C   D
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [163]:
numbers_df_3.set_index('C')

     A   B   D
C
3    1   2   4
7    5   6   8
11   9  10  12
15  13  14  16

In [164]:
#TODO:
numbers_df_3.reset_index(inplace=True)

In [165]:
numbers_df_3

   index   A   B   C   D
0      0   1   2   3   4
1      1   5   6   7   8
2      2   9  10  11  12
3      3  13  14  15  16

In [166]:
titanic_df.isnull().sum()

Passengerid    0
Age            0
Fare           0
Sex            0
sibsp          0
zero           0
zero.1         0
zero.2         0
zero.3         0
zero.4         0
zero.5         0
zero.6         0
Parch          0
zero.7         0
zero.8         0
zero.9         0
zero.10        0
zero.11        0
zero.12        0
zero.13        0
zero.14        0
Pclass         0
zero.15        0
zero.16        0
Embarked       2
zero.17        0
zero.18        0
2urvived       0
dtype: int64

In [167]:
# from multi dimensional nddarray
ndarr = np.arange(1,7).reshape(3,2)
print(ndarr)

df_arr = pd.DataFrame(ndarr, index=['row1','row2','row3'],columns=['col1', 'col2'])
df_arr

[[1 2]
 [3 4]
 [5 6]]

      col1  col2
row1     1     2
row2     3     4
row3     5     6

In [168]:
numbers_df

    0   1   2   3
0   1   2   3   4
1   5   6   7   8
2   9  10  11  12
3  13  14  15  16

In [169]:
# TODO:
# numbers_df['New'] = [1, None*1000, 10001]
# numbers_df

In [170]:
# excel_df = pd.read_excel('../../datasets/magnetic stirrer.xlsx')

drinks = pd.read_csv('https://raw.githubusercontent.com/ProgressBG-Python-Course/JupyterNotebooksExamples/master/datasets/various/drinks.csv')
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [171]:
# get the coutry column only
# drinks['country']
drinks.country

0      Afghanistan
1          Albania
2          Algeria
3          Andorra
4           Angola
          ...
188      Venezuela
189        Vietnam
190          Yemen
191         Zambia
192       Zimbabwe
Name: country, Length: 193, dtype: object

In [172]:
# 
a = np.arange(1,11).reshape(5,2)
a

array([[ 1,  2],
       [ 3,  4],
       [ 5,  6],
       [ 7,  8],
       [ 9, 10]])

In [173]:
mask = ( (a[:,0] == 5) | (a[:,0] == 9)  )
print(mask)
a[mask]

[False False  True False  True]

array([[ 5,  6],
       [ 9, 10]])

In [174]:
drinks[(drinks.country == 'Bulgaria') | (drinks.country == 'France')]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
25,Bulgaria,231,252,94,10.3,EU
61,France,127,151,370,11.8,EU

In [175]:
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

In [176]:
# get all rows for EU countries:
eu_drinks = drinks[ drinks.continent == 'EU' ]
eu_drinks.head(3)

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
1,Albania,89,132,54,4.9,EU
3,Andorra,245,138,312,12.4,EU
7,Armenia,21,179,11,3.8,EU

In [177]:
# get all rows for EU countries for which wine_servings == 0 :
drinks[ (drinks.continent=='EU') & (drinks.wine_servings == 0) ]

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
111,Monaco,0,0,0,0.0,EU
147,San Marino,0,0,0,0.0,EU

In [178]:
drinks.describe()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

In [179]:
# get the  max_wine_servings:
max_wine_servings = drinks.wine_servings.max()
max_wine_servings

370

In [180]:
# get the country with max_wine_servings:
drinks[ drinks.wine_servings == max_wine_servings ].country
print(drinks[ drinks.wine_servings == max_wine_servings ].country)

61    France
Name: country, dtype: object

In [181]:
# show the sum of missing values per column:
print(drinks.isnull().sum())

country                          0
beer_servings                    0
spirit_servings                  0
wine_servings                    0
total_litres_of_pure_alcohol     0
continent                       23
dtype: int64

In [182]:
# print the names of the countries with missing continent value:
drinks[ drinks.continent.isnull() ].country

5                 Antigua & Barbuda
11                          Bahamas
14                         Barbados
17                           Belize
32                           Canada
41                       Costa Rica
43                             Cuba
50                         Dominica
51               Dominican Republic
54                      El Salvador
68                          Grenada
69                        Guatemala
73                            Haiti
74                         Honduras
84                          Jamaica
109                          Mexico
122                       Nicaragua
130                          Panama
143               St. Kitts & Nevis
144                       St. Lucia
145    St. Vincent & the Grenadines
174               Trinidad & Tobago
184                             USA
Name: country, dtype: object

In [183]:
new_drinks = drinks.drop('total_litres_of_pure_alcohol', axis=1)
new_drinks.head()

       country  beer_servings  spirit_servings  wine_servings continent
0  Afghanistan              0                0              0        AS
1      Albania             89              132             54        EU
2      Algeria             25                0             14        AF
3      Andorra            245              138            312        EU
4       Angola            217               57             45        AF

In [186]:
# set index:
drinks_by_country = drinks.set_index('country')
drinks_by_country

# reset index:
drinks_by_country.reset_index(inplace=TrueS)
drinks_by_country

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,0,0,0,0.0,AS
1,89,132,54,4.9,EU
2,25,0,14,0.7,AF
3,245,138,312,12.4,EU
4,217,57,45,5.9,AF
...,...,...,...,...,...
188,333,100,3,7.7,SA
189,111,2,1,2.0,AS
190,6,0,0,0.1,AS
191,32,19,4,2.5,AF
192,64,18,4,4.7,AF